Revit 2027 API
AnalysisDisplayStyle.GetDiagramSettings Method
 Get diagram settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDiagramSettings GetDiagramSettings()
Public Function GetDiagramSettings As AnalysisDisplayDiagramSettings
public:
AnalysisDisplayDiagramSettings^ GetDiagramSettings()
member GetDiagramSettings : unit -> AnalysisDisplayDiagramSettings
Return Value
AnalysisDisplayDiagramSettings
Exceptions
Exception | Condition
InvalidOperationException |  diagram settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace